app/controllers/zooms_controller.rb

def index
   @zooms = Zoom.all
---
SELECT "zooms".* FROM "zooms"  ORDER BY created_at DESC

 def create
   @zoom = current_user.zooms.build(zoom_params)
   if @zoom.save
---
INSERT INTO "zooms" ("description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "scott admin zoom"], ["user_id", 3], ["created_at", "2016-04-07 17:18:59.675952"], ["updated_at", "2016-04-07 17:18:59.675952"]]

 def update
  if @zoom.update(zoom_params)
---
UPDATE "zooms" SET "description" = $1, "updated_at" = $2 WHERE "zooms"."id" = $3  [["description", "Hello There. Edit 1"], ["updated_at", "2016-04-07 16:55:00.830978"], ["id", 1]]

 def destroy
   @zoom.destroy
---
DELETE FROM "zooms" WHERE "zooms"."id" = $1  [["id", 20]]

   def set_zoom
     @zoom = Zoom.find(params[:id])
---
SELECT  "zooms".* FROM "zooms" WHERE "zooms"."id" = $1 LIMIT 1  [["id", 20]]