app/controllers/zooms_controller.rb

SELECT COUNT(*) FROM "zooms"
---
    def index
        @zooms = Zoom.all.order('created_at DESC').paginate(page: params[:page], per_page: 5)